app.config = {

  server: {
    baseUrl: '#',
    defaultIp: '127.0.0.1',
    defaultPort: '9600'
  },
  works: {
    gzhacker: [
      {
        isfirst: true,
        imgurl: './public/images/hacker01.JPG',
        imgalt: '2',
        href: 'https://plus.google.com/photos/114920001331857622210/albums/5830155029390732513?authkey=CNPT-Y-V3fqJ4gE',
        caption: '人生中见到第一批程序员（2012年4月10日加入HCI）到此时除了android加减乘除计算器和js计时器demo便什么都不会了，' 
          + '也在大牛云集的bata提点子,点子是《手机防摔保护程序》。——第四届广州高校编程马拉松 2012年8月'
      },
      {
        imgurl: './public/images/hacker02.JPG',
        imgalt: '2',
        href: 'https://plus.google.com/photos/114920001331857622210/albums/5830155029390732513?authkey=CNPT-Y-V3fqJ4gE',
        caption: '右边是现场组的唯一一位队友，和我一样的编程基础，在马拉松进行了6个小时之后和我道别，我孤军挣扎了一会也只好去晚饭了。'
      },
      {
        imgurl: './public/images/hacker03.JPG',
        imgalt: '3',
        href: 'https://plus.google.com/photos/114920001331857622210/albums/5830155029390732513?authkey=CNPT-Y-V3fqJ4gE',
        caption: '实现自我保护功能是利用手机自带的加速度传感器，通过三维加速度计算和判断非正常移动则采取措施，同伴离开计划失败后，' 
          + '和GDG三位导师实现自行车助手的技术一致，然后anson收留我一起写bikeplus。'
      },
      {
        imgurl: './public/images/hacker04.JPG',
        imgalt: '4',
        href: 'https://plus.google.com/photos/114920001331857622210/albums/5830155029390732513?authkey=CNPT-Y-V3fqJ4gE',
        caption: '没有做出什么成果，在anson的指导下完成了条形图的绘制，然后凌晨在2楼露天院子的沙发上睡了5个小时，第一次24编程的体会是：我将来要成为程序员。'
      }
    ],
    codejam: [
      {
        isfirst: true,
        imgurl: './public/images/codejam00.JPG',
        imgalt: '1',
        href: 'http://segmentfault.com/e/codejam-guangzhou-2013-p3',
        caption: '两人组合（鹏飞：硬件出生的软件工程师 大宝：硬件工程师）需要一个安卓开发，没有任何同伴也没有任何准备的我有幸被邀请加入。'
          + '<br>——2013中国移动开发者大赛'
      },
      {
        imgurl: './public/images/codejam01.JPG',
        imgalt: '1',
        href: 'http://segmentfault.com/e/codejam-guangzhou-2013-p3',
        caption: '编程进行了24个小时之后，到了我们《唤醒灯》成果展示的时间，鹏飞解说，我在幕后操作手机客户端，屏幕上看到的黑白时间定时界面' 
          + '就是我几百年不动摇的黑白风格了。'
      },
      {
        imgurl: './public/images/codejam02.JPG',
        imgalt: '2',
        href: 'http://segmentfault.com/e/codejam-guangzhou-2013-p3',
        caption: '灯已经慢慢亮到可以唤醒睡眠的人，大家都在等遥控关灯，结果android和单片机的连接超时，求原谅。'
      },
      {
        imgurl: './public/images/codejam03.JPG',
        imgalt: '3',
        href: 'http://segmentfault.com/e/codejam-guangzhou-2013-p3',
        caption: '演示出状况得了第四名，后来主办方计算了作品数量解释说第四名开始是优秀奖，好吧，第一名优秀奖。'
      }
    ],
    intern: [
      {
        isfirst: true,
        imgurl: './public/images/intern01.jpg',
        imgalt: '1',
        caption: '“实习之后就可以拿到学分了”, 抱着这样的心情在UC的第一天。'
      },
      {
        imgurl: './public/images/intern02.jpg',
        imgalt: '2',
        caption: '一年零三个月陪伴我所有编程之路的操作系统，求助了linux大神也没能成功编译tplink55××驱动，解决办法是换网卡。'
      },
      {
        imgurl: './public/images/intern03.jpg',
        imgalt: '3',
        caption: '他们很忙我很少和他们交流，这块地方总是停电和服务器down机，以至于最初的开发过程满满的都是技术和硬件的挑战。'
      },
      {
        imgurl: './public/images/intern04.jpg',
        imgalt: '4',
        caption: '参与四个线上活动的Java后台和Javascript前端，加上没用心，我不是反应迟钝，相信我！'
      },
      {
        imgurl: './public/images/intern05.jpg',
        imgalt: '5',
        caption: '没有强烈留在公司的愿望成真了。<br>“推广产品和推倒妹子”一点也不好笑了。'
      },
      {
        imgurl: './public/images/intern06.jpg',
        imgalt: '6',
        caption: '为当初的轻浮付出的代价——回不去的位置。'
      }
    ],
    hope: [
      {
      	isfirst: true,
        imgurl: './public/images/hope17.jpg',
        imgalt: '1',
        caption: '是个经济学家、高级管理人才，还能写MIS，然后预测下个金融危机，开个公司自己管理生产运作，又做个技术总监，研发个类xx OS。'
          + '—— 标准的信息管理与信息系统专业期望的全才啊'
      },
      {
        imgurl: './public/images/hope01.JPG',
        imgalt: '1',
        href: 'https://plus.google.com/photos/114920001331857622210/albums/5841418929094126033',
        caption: '想跟着学编程的时候，不会被孤立。'
      },
      {
        imgurl: './public/images/hope05.JPG',
        imgalt: '1',
        caption: '不会被边缘化。'
      },
      {
        imgurl: './public/images/hope02.JPG',
        imgalt: '1',
        caption: '入迷的时候背影不这么脏、乱。'
      },
      {
        imgurl: './public/images/hope03.jpg',
        imgalt: '1',
        caption: '好不容易上一次台，注意点形象。'
      },
      {
        imgurl: './public/images/hope15.jpg',
        imgalt: '1',
        caption: '永远在最可爱的角度被拍。'
      },
      {
        imgurl: './public/images/hope.jpg',
        imgalt: '1',
        caption: '吃的都长在该肥的地方。'
      },
      {
        imgurl: './public/images/hope04.JPG',
        imgalt: '1',
        caption: '不会营养不良状。'
      },
      {
        imgurl: './public/images/hope07.jpg',
        imgalt: '1',
        caption: '像女生一样有美丽回眸，长发飘飘。。'
      },
      {
        imgurl: './public/images/hope08.jpg',
        imgalt: '1',
        caption: '穿个裙子也能像个女神。'
      },
      {
        imgurl: './public/images/hope06.jpg',
        imgalt: '1',
        caption: '有数不清的朋友，4个，5个。。'
      },
      {
        imgurl: './public/images/hope13.png',
        imgalt: '1',
        caption: '有永远的闺蜜，在最失落和最幸福的时候都不离不弃。'
      },
      {
        imgurl: './public/images/hope14.png',
        imgalt: '1',
        caption: '去哪都有同伴同行，互相保护和陪伴，<br>互相定格纪念一起游玩的快乐。'
      },
      {
        imgurl: './public/images/hope10.jpg',
        imgalt: '1',
        caption: '技术牛人算法很厉害，平铺3个以上屏幕，是实验室最强悍的女生。'
      },
      {
        imgurl: './public/images/hope11.jpg',
        imgalt: '1',
        caption: '吉他很厉害，还能飙海豚音，唱个《浏览未来》拿个名次。'
      },
      {
        imgurl: './public/images/hope12.jpg',
        imgalt: '1',
        caption: '拥有男人的强大、女人的细腻、萝莉的外表、老人的智慧，<br>玩得了CS，写得了OS'
      }
    ]
  },
  ablum: [
    {
   //和数据库select出来的id即tagid一致，所以不从0开始
      tagid: 1,
      tagname: 'GZ第四届Hacker'
    },
    {
      tagid: 2,
      tagname: '2013移动开发者',
    },
    {
      tagid: 3,
      tagname: 'UC暑假',
      select: true
    },
    {
      tagid: 4,
      tagname: '希望与现实'
    }
  ],
  heart: {
    tag: '心路',
    title: '实习是一段没有恋的失恋',
    desc: '直到离开才知道喜欢，不管任何理由一次失败我再努力都不行了吗？',
    posts: [
      {
      	time: '2013-07-10 20：17',
      	content: '报到第一天，竟然和引导人说没有想过要留在uc。是真心没有想过，连实习是什么都不知道，简单的期待实习的第二天会发生什么。'
      },
      {
      	time: '2013-08-23 21：35',
      	content: '线上活动都在easy-play框架上写，框架太好的结果就是开发没有技术含量了，感觉没有进步了。在天猫的同学在做大数据，好酷啊。'
      },
      {
      	time: '2013-10-10 16：43',
      	content: '像往常一样：“熊姐、钗钗我先走了”，有些书、笔记本、抱枕还有一些琐碎的，一起带走会好多吧，所以留下了。'
      	 + '像我一样才知道要离开就真的面临离开的朋友，对不起，既然会湿润眼眶就不要目送了。'
      },
      {
      	time: '2013-10-10 17:54',
      	content: '“很庆幸不是我鼓起勇气离开，而是uc把我踢了，我再也不用写无趣的线上活动了”——吞了口水和强力回收眼泪，然后安慰自己或许有天可以去杭州呢！'
      },
      {
      	time: '2013-10-10 20:09',
      	content: '其实，我没有想像的那么坚强，怎么安慰自己结果和当初的想法一样，但不想离开的已经不是一个没有感情的公司。' 
      	  + '在无人的角落，看着Aaron的短信，眼泪再也控制不住了，根本就一点也不坚强，一切在安全的地方表现的都是骗人的。'
      },
      {
      	time: '2013-10-21 09:35',
      	content: '不知道情况会变成这样，拥有的时候高傲地不想珍惜，失去了心却会崩溃，结果已经是这样了谁能救我？？？？？﻿'
      	  + '好想Aaron，好想18楼，好想项目上线那刻的快乐。。。。。未来一定要编程，那就只想回到uc回到uc！！谁能给我机会？？？？？'
      },
      {
      	time: '2013-11-28 17:22',
      	content: '很快地问完哥哥的伤势和妈妈说没事就挂了吧，因为眼泪和哭腔就要出来了，不能被妈妈知道，我一个人也很脆弱，也一直滴着血，' 
      	  + '一直无法愈合伤口。。。。。﻿为什么我每次不快乐不顺利都在预告家人会出事，求任何代价让我回到uc，我会带领一切回到正常，哥哥我好想你们',
      },
      {
      	time: '2013-11-14 15:09',
      	content: '不说话，说很少话，说很多话，都是同一个人，谁在身边你要说着词不达意的话，谁不在身边思念想念甚至是怀念你要故作坚强，' 
      	  + '还有就是根本不知道谁将会在身边才要这样住在墙里坐着站着或蹲着也不会被人发现的世界里不被谁影响到。我会走出来的，给我回去uc的机会，' 
      	  + '我会向所有﻿戴着耳塞假装没有听到和我说话的人道歉，我会敞开心扉和他们做朋友，分享痛和快乐。'
      },
      {
      	time: '2013-11-16 18:32',
      	content: '我好怕我恢复不了，妈妈的快乐会消失，好怕我的不开心最终都关联了家人，不要这样好吗？'
      	  + '让一切都明朗起来，我不想家人再受伤而我依旧无能为力，我不要不要这种无助的感觉，不要不要不要，，，，，父亲你回来帮我好吗？心好痛好想你，'
      	  + '我的记忆里根本就没有你和我分担的任何事情，也没有快乐，你是谁，你在哪？求你来到我身边好吗？混蛋。'
      },
      {
      	time: '2013-11-18 21:34',
      	content: '我能熬过这段时间吗？痛苦和悔恨会有尽头吗？？？就算现在可以去杭州，当然现实是去不了，所以去不了的时候再说想回到'
      	  + 'uc就是马后炮，不管是否真心了吗？？？不会有人理会此时的心情，最坏的情况已经在我最开始表现出来的那份真的高傲里，就像犯罪留下的污点，永远无法抹去。'
      },
      {
      	time: '2013-11-22 18:01',
      	content: '等待的每一天每个时刻都是煎熬，看不到希望，命运不在我手上，最在乎最强烈渴求的目标最伤害自己，' 
      	  + '我可以承受孤独但不要在技术路上一直冷清得只有一个人，我不够坚强独自面对所有的挫折，原谅我不曾接受任何人陪在我身边，' 
      	  + '原谅我又孤僻又高傲的内心，原谅我对技术方向的迷乱而轻浮表现的实习，原谅我所有的错，我会改的，我会融入别人的世界，' 
      	  + '我会尊重每一个人，会和上司说话，会好好学习技术专心做事，求uc再给我一次机会，不要一直暗无天日，我受不了放弃自己却也无能为力的颓废。﻿'
      },
      {
      	time: '2013-11-23 09:32',
      	content: '只有一个人会在我封闭自己的时候用尽所有方式找我，不管发生什么事都不需要这样,我在乎的人用我在乎的方式存在我在乎的世界，我不会让你担心。' 
      	  + '你不在我触手可及的内存，我怎么安全去处理你的指令呢？现实这么残酷我封闭自己对不起原来还有别人，伤害你的时候我也永远load不进别人（uc）的空间，' 
      	  + '别人（uc）也永远不care我存储了多少对ta的向往。﻿'
      },
      {
      	time: '2013-11-23 20:09',
      	content: '打击越大进步就会越大，我从没受过在这样的打击，从调整好心情之后就什么都没做，用心学习几十天是可以有很大进步的，' 
      	  + '为什么没有人相信我，为什么不再相信我？？'
      },
    ]
  },
  summary: {
    tag: '总结',
    title: '实习问题总结',
    desc: '我不是圣人，在缺乏亲情的求学生涯，总是一贯又高傲又自卑，但我会改的',
    posts: [
      {
        q: '目标不明确',
        a: '去年4月开始，学习基本数据类型和开发环境配置，到后来写出可以运行的应用程序，一年半时间很长，能力只到现在的水平可能进步不是很大，' 
          + '这是我选择的大路。对于小路，Web应用、移动app、数据挖掘、运维？直到实习结束我还不知道。web前端和后台是作业和课程设计需要的，' 
          + '所以先接触了，以为那只是开始，还要再接触其他，如算法、信息安全、大数据，这样之后才能决定未来的方向。离职后的时间，我深刻认识到，' 
          + '好奇心、好学、好强是对的，但要精通一门技术，才能作为学习更多知识的前提。'
      },
      {
        q: '不喜欢前端',
        a: '实习前后我其实从未进入过前端的世界，粗糙地以为兼容ie是前端的全部障碍就本能地逃避了任何形式的前端。' 
          + '和实验室同学参与过东莞银行授信系统的前端，但只是做了html、css和简单的js，框架中使用的backbone.js和underscode.js以库的形式调用，' 
          + '我看懂了api之后就只是在搭好的框架里面帮忙填代码了。而实习期间参与前端的两个项目《个性壁纸大赛》和《UC搬新家新闻推送》，' 
          + '第一个是在引导人钗钗基本完成情况下的继续完善，第一次熟悉别人的代码和理解原作者的设计思想花了很多时间；第二个是我搭建整个前端架构的，' 
          + '在没有接触的新功能carousel上，添加loading、预加载和懒加载功能时对elf源码不熟，导致需要修改或增加功能的地方非要引导人帮忙改框架源码。' 
          + '引导人对前端的执着，方向明确全身心地投入，这些实习期间我都没有做到。'
      },
      {
        q: '不和人沟通',
        a: '除了《浏览未来》歌唱比赛提交了想要搞笑却被难听占据所有重点的mp3文件，组内同学和我说话、活动邀请我都本能地逃避。还没学习编程的时候活跃于' 
          + '其他非技术社团，努力地刷存在感，刚进HCI还被认为是最吵最烦的不男不女的女生，后来我发现很酷的人是ACM里算法很厉害的人，' 
          + '而我认为的很酷的人从来没有接受我进入他们的圈子，渐渐地越来越独立。但独立学习很寂寞，所以也在实验室不停地看综艺节目，' 
          + '找不到编程以外的兴趣就躲在楼顶弹吉他，后来强大到不需要和任何人沟通也能活过好多天，甚至一周接着一周。我不确定运营研发组的同学是不是会接受我走进他们，' 
          + '所以孤立自己想到先学好技术明确了目标再慢慢融入和他们有共同追求的世界。'
      },
      {
        q: '对留UC犹豫不决',
        a: '不想欺骗自己，不想说谎，尤其不想迎合上司，直到离开都对UC没有任何喜欢也没有任何厌恶，最宽心的是实习结束了就拿到学分了，也没有想过毕业后工作的事，' 
          + '还有引导人说如果给了offer毕业后又不签会影响人力规划， 加上我技术方向不明确，还有觉得淘汰了我比自己厉害的实验室同学的面试官和hr都是乱来的，' 
          + '但我还是没有勇气说不留，而是在听到“申请了留之后也不一定能留下”之后爽快地说“那申请留吧”。被离职后得知我报不平的朋友们已经去了想去的公司，' 
          + '我才知道当初被肯定是我多么珍贵的财富，瞎高傲和瞎自卑都是自己的问题。'
      },
      {
        q: '实习业绩不好',
        a: '主管希望我写前端，在不喜欢的领域不太用心，觉得每走一步都不在轨道上。期间还有mtelnet公司的android应用，' 
          + '不知道后来完成了一个还要完成一系列功能相同的应用，晚上和周末都在编程，上班没有精神。9月2号开学之后有学委“点名了”的短信和催交经济管理类' 
          + '作业的电话，10月9日有课程考试……对不起，实习没有专心 ，项目没有完成得很好。主管说，这是被离职最大的原因。我知道这是不争的事实，' 
          + '但我不是反映迟钝，相信我。'
      },
      {
        q: '参加歌唱比赛很难听',
        a: '喜欢听歌也有认识到唱得很烂，参加比赛的想法是想要搞笑，实验室的朋友很无聊，就陪我熬夜hight歌录歌然后由剪辑的同学把mp3发给公司参赛邮箱，' 
          + '然而我忘了在实习期间一开始就以安静的形象出现，结果难听的歌声一点也不好笑。'
      }
    ]
  },
  wish: {
    title: 'Happy *day !',
    desc: '1*.2*',
    post: '&nbsp;&nbsp;&nbsp;&nbsp;' 
      + '有你的地方不太快乐，装高傲离开了uc，坐地铁总不在正确的方向，离开公司就没有路线，拉坏九楼的玻璃门，摔伤师妹的古典吉他，' 
      + '还要半个多月恢复原本的生活，在wb面前暴露所有的脆弱祈求回去。'
      + '记不起任何有过快乐的时候，对吧？ ' 
      + '越来越没有希望再见一开始就不要出现啊，所有该回忆和想念的地方都由一个人承担，我才是浑蛋。'
      + '但一直没有忘记希望我在乎的人快乐，我不是博克斯，对不能给予我任何意义的人消失在我世界中无能为力。'
      + '下个没有人知道的只属于父亲给予我的生日那天，我也会祝她快乐。'
  }
  
};